Aribababa/Embedded-Systems/S08 OS/Headers/mc9s08qg8.h
#define SPIS_MODF_MASK                  16U
#define SPIS_SPTEF_MASK                 32U
#define SPIS_SPRF_MASK                  128U


/*** SPID - SPI Data Register; 0x0000002D ***/
typedef union {
  byte Byte;
} SPIDSTR;
extern volatile SPIDSTR _SPID @0x0000002D;
#define SPID                            _SPID.Byte


/*** IICA - IIC Address Register; 0x00000030 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte ADDR1       :1;                                       /* Slave Address Bit 1 */
    byte ADDR2       :1;                                       /* Slave Address Bit 2 */
    byte ADDR3       :1;                                       /* Slave Address Bit 3 */
    byte ADDR4       :1;                                       /* Slave Address Bit 4 */
    byte ADDR5       :1;                                       /* Slave Address Bit 5 */
    byte ADDR6       :1;                                       /* Slave Address Bit 6 */
    byte ADDR7       :1;                                       /* Slave Address Bit 7 */
  } Bits;
  struct {
    byte         :1;
    byte grpADDR_1 :7;
  } MergedBits;
} IICASTR;
extern volatile IICASTR _IICA @0x00000030;
#define IICA                            _IICA.Byte
#define IICA_ADDR1                      _IICA.Bits.ADDR1
#define IICA_ADDR2                      _IICA.Bits.ADDR2
#define IICA_ADDR3                      _IICA.Bits.ADDR3
#define IICA_ADDR4                      _IICA.Bits.ADDR4
#define IICA_ADDR5                      _IICA.Bits.ADDR5
#define IICA_ADDR6                      _IICA.Bits.ADDR6
#define IICA_ADDR7                      _IICA.Bits.ADDR7
#define IICA_ADDR_1                     _IICA.MergedBits.grpADDR_1
#define IICA_ADDR                       IICA_ADDR_1

#define IICA_ADDR1_MASK                 2U
#define IICA_ADDR2_MASK                 4U
#define IICA_ADDR3_MASK                 8U
#define IICA_ADDR4_MASK                 16U
#define IICA_ADDR5_MASK                 32U
#define IICA_ADDR6_MASK                 64U
#define IICA_ADDR7_MASK                 128U
#define IICA_ADDR_1_MASK                254U
#define IICA_ADDR_1_BITNUM              1U


/*** IICF - IIC Frequency Divider Register; 0x00000031 ***/
typedef union {
  byte Byte;
  struct {
    byte ICR0        :1;                                       /* IIC Clock Rate Bit 0 */
    byte ICR1        :1;                                       /* IIC Clock Rate Bit 1 */
    byte ICR2        :1;                                       /* IIC Clock Rate Bit 2 */
    byte ICR3        :1;                                       /* IIC Clock Rate Bit 3 */
    byte ICR4        :1;                                       /* IIC Clock Rate Bit 4 */
    byte ICR5        :1;                                       /* IIC Clock Rate Bit 5 */
    byte MULT0       :1;                                       /* Multiplier Factor Bit 0 */
    byte MULT1       :1;                                       /* Multiplier Factor Bit 1 */
  } Bits;
  struct {
    byte grpICR  :6;
    byte grpMULT :2;
  } MergedBits;
} IICFSTR;
extern volatile IICFSTR _IICF @0x00000031;
#define IICF                            _IICF.Byte
#define IICF_ICR0                       _IICF.Bits.ICR0
#define IICF_ICR1                       _IICF.Bits.ICR1
#define IICF_ICR2                       _IICF.Bits.ICR2
#define IICF_ICR3                       _IICF.Bits.ICR3
#define IICF_ICR4                       _IICF.Bits.ICR4
#define IICF_ICR5                       _IICF.Bits.ICR5
#define IICF_MULT0                      _IICF.Bits.MULT0
#define IICF_MULT1                      _IICF.Bits.MULT1
#define IICF_ICR                        _IICF.MergedBits.grpICR
#define IICF_MULT                       _IICF.MergedBits.grpMULT

#define IICF_ICR0_MASK                  1U
#define IICF_ICR1_MASK                  2U
#define IICF_ICR2_MASK                  4U
#define IICF_ICR3_MASK                  8U
#define IICF_ICR4_MASK                  16U
#define IICF_ICR5_MASK                  32U
#define IICF_MULT0_MASK                 64U
#define IICF_MULT1_MASK                 128U
#define IICF_ICR_MASK                   63U
#define IICF_ICR_BITNUM                 0U
#define IICF_MULT_MASK                  192U
#define IICF_MULT_BITNUM                6U


/*** IICC - IIC Control Register; 0x00000032 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte RSTA        :1;                                       /* Repeat START */
    byte TXAK        :1;                                       /* Transmit Acknowledge Enable */
    byte TX          :1;                                       /* Transmit Mode Select */
    byte MST         :1;                                       /* Master Mode Select */
    byte IICIE       :1;                                       /* IIC Interrupt Enable */
    byte IICEN       :1;                                       /* IIC Enable */
  } Bits;
} IICCSTR;
extern volatile IICCSTR _IICC @0x00000032;
#define IICC                            _IICC.Byte
#define IICC_RSTA                       _IICC.Bits.RSTA
#define IICC_TXAK                       _IICC.Bits.TXAK
#define IICC_TX                         _IICC.Bits.TX
#define IICC_MST                        _IICC.Bits.MST
#define IICC_IICIE                      _IICC.Bits.IICIE
#define IICC_IICEN                      _IICC.Bits.IICEN

#define IICC_RSTA_MASK                  4U
#define IICC_TXAK_MASK                  8U
#define IICC_TX_MASK                    16U
#define IICC_MST_MASK                   32U
#define IICC_IICIE_MASK                 64U
#define IICC_IICEN_MASK                 128U


/*** IICS - IIC Status Register; 0x00000033 ***/
typedef union {
  byte Byte;
  struct {
    byte RXAK        :1;                                       /* Receive Acknowledge */
    byte IICIF       :1;                                       /* IIC Interrupt Flag */
    byte SRW         :1;                                       /* Slave Read/Write */
    byte             :1; 
    byte ARBL        :1;                                       /* Arbitration Lost */
    byte BUSY        :1;                                       /* Bus Busy */
    byte IAAS        :1;                                       /* Addressed as a Slave */
    byte TCF         :1;                                       /* Transfer Complete Flag */
  } Bits;
} IICSSTR;
extern volatile IICSSTR _IICS @0x00000033;
#define IICS                            _IICS.Byte
#define IICS_RXAK                       _IICS.Bits.RXAK
#define IICS_IICIF                      _IICS.Bits.IICIF
#define IICS_SRW                        _IICS.Bits.SRW
#define IICS_ARBL                       _IICS.Bits.ARBL
#define IICS_BUSY                       _IICS.Bits.BUSY
#define IICS_IAAS                       _IICS.Bits.IAAS
#define IICS_TCF                        _IICS.Bits.TCF

#define IICS_RXAK_MASK                  1U
#define IICS_IICIF_MASK                 2U
#define IICS_SRW_MASK                   4U
#define IICS_ARBL_MASK                  16U
#define IICS_BUSY_MASK                  32U
#define IICS_IAAS_MASK                  64U
#define IICS_TCF_MASK                   128U


