Aribababa/Embedded-Systems/S08 OS/Headers/mc9s08qg8.h
/*** NVOPT - Nonvolatile Flash Options Register; 0x0000FFBF ***/
typedef union {
  byte Byte;
  struct {
    byte SEC00       :1;                                       /* Security State Code, bit 0 */
    byte SEC01       :1;                                       /* Security State Code, bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte FNORED      :1;                                       /* Vector Redirection Disable */
    byte KEYEN       :1;                                       /* Backdoor Key Mechanism Enable */
  } Bits;
  struct {
    byte grpSEC0 :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} NVOPTSTR;
/* Tip for register initialization in the user code:  const byte NVOPT_INIT @0x0000FFBF = <NVOPT_INITVAL>; */
#define _NVOPT (*(const NVOPTSTR * __far)0x0000FFBF)
#define NVOPT                           _NVOPT.Byte
#define NVOPT_SEC00                     _NVOPT.Bits.SEC00
#define NVOPT_SEC01                     _NVOPT.Bits.SEC01
#define NVOPT_FNORED                    _NVOPT.Bits.FNORED
#define NVOPT_KEYEN                     _NVOPT.Bits.KEYEN
#define NVOPT_SEC0                      _NVOPT.MergedBits.grpSEC0

#define NVOPT_SEC00_MASK                1U
#define NVOPT_SEC01_MASK                2U
#define NVOPT_FNORED_MASK               64U
#define NVOPT_KEYEN_MASK                128U
#define NVOPT_SEC0_MASK                 3U
#define NVOPT_SEC0_BITNUM               0U



/* Flash commands */
#define mBlank                          0x05
#define mBurstProg                      0x25
#define mByteProg                       0x20
#define mMassErase                      0x41
#define mPageErase                      0x40


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */
/*
 * Follows changes from the database 2.87.108 version */
#define IICA_ADDR_BITNUM                 IICA_ADDR_1_BITNUM
#define IICA_ADDR_MASK                   IICA_ADDR_1_MASK
#define IICA_ADDR0                       This_symb_has_been_depreciated
#define IICA_ADDR0_MASK                  This_symb_has_been_depreciated
/*
 * Follows changes from the database 2.87.132 version */
#define SDIDH_REV                        This_symb_has_been_depreciated
#define SDIDH_REV_BITNUM                 This_symb_has_been_depreciated
#define SDIDH_REV_MASK                   This_symb_has_been_depreciated
#define SDIDH_REV0                       This_symb_has_been_depreciated
#define SDIDH_REV0_MASK                  This_symb_has_been_depreciated
#define SDIDH_REV1                       This_symb_has_been_depreciated
#define SDIDH_REV1_MASK                  This_symb_has_been_depreciated
#define SDIDH_REV2                       This_symb_has_been_depreciated
#define SDIDH_REV2_MASK                  This_symb_has_been_depreciated
#define SDIDH_REV3                       This_symb_has_been_depreciated
#define SDIDH_REV3_MASK                  This_symb_has_been_depreciated


/* **** 18.1.2008 12:01:49 */

#define _NV_FTRIM                        _NVFTRIM
#define NV_FTRIM                         NVFTRIM
#define NV_FTRIM_FTRIM                   NVFTRIM_FTRIM
#define NV_FTRIM_FTRIM_MASK              NVFTRIM_FTRIM_MASK
#define _NV_ICSTRM                       _NVICSTRM
#define NV_ICSTRM                        NVICSTRM
#define NV_ICSTRM_TRIM0                  NVICSTRM_TRIM0
#define NV_ICSTRM_TRIM1                  NVICSTRM_TRIM1
#define NV_ICSTRM_TRIM2                  NVICSTRM_TRIM2
#define NV_ICSTRM_TRIM3                  NVICSTRM_TRIM3
#define NV_ICSTRM_TRIM4                  NVICSTRM_TRIM4
#define NV_ICSTRM_TRIM5                  NVICSTRM_TRIM5
#define NV_ICSTRM_TRIM6                  NVICSTRM_TRIM6
#define NV_ICSTRM_TRIM7                  NVICSTRM_TRIM7
#define NV_ICSTRM_TRIM0_MASK             NVICSTRM_TRIM0_MASK
#define NV_ICSTRM_TRIM1_MASK             NVICSTRM_TRIM1_MASK
#define NV_ICSTRM_TRIM2_MASK             NVICSTRM_TRIM2_MASK
#define NV_ICSTRM_TRIM3_MASK             NVICSTRM_TRIM3_MASK
#define NV_ICSTRM_TRIM4_MASK             NVICSTRM_TRIM4_MASK
#define NV_ICSTRM_TRIM5_MASK             NVICSTRM_TRIM5_MASK
#define NV_ICSTRM_TRIM6_MASK             NVICSTRM_TRIM6_MASK
#define NV_ICSTRM_TRIM7_MASK             NVICSTRM_TRIM7_MASK

/* **** 14.07.2008 */

#define Reserved2                        VReserved22
#define Reserved3                        VReserved21
#define Reserved13                       VReserved11
#define Reserved14                       VReserved10 
#define Reserved15                       VReserved9 
#define Reserved16                       VReserved8
#define Reserved20                       VReserved4
#define VectorNumber_Reserved2           VectorNumber_VReserved22
#define VectorNumber_Reserved3           VectorNumber_VReserved21
#define VectorNumber_Reserved13          VectorNumber_VReserved11
#define VectorNumber_Reserved14          VectorNumber_VReserved10 
#define VectorNumber_Reserved15          VectorNumber_VReserved9 
#define VectorNumber_Reserved16          VectorNumber_VReserved8
#define VectorNumber_Reserved20          VectorNumber_VReserved4
#endif
/*lint -restore  +esym(961,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
